### Import pandas as pd

In [3]:
import pandas as pd

import os

In [4]:
os.chdir('E:\\Data Science _TR\\Datasets\\')
print(os.getcwd())

E:\Data Science _TR\Datasets

In [5]:
#pd.read_csv('point to dataset')
df= pd.read_csv("Diabetes.csv")
df

,Number of times pregnant,Plasma glucose concentration,Diastolic blood pressure,Triceps skin fold thickness,2-Hour serum insulin,Body mass index,Diabetes pedigree function,Age (years),Class variable
0,6,148,72,35,0,33.6,0.627,50,YES
1,1,85,66,29,0,26.6,0.351,31,NO
2,8,183,64,0,0,23.3,0.672,32,YES
3,1,89,66,23,94,28.1,0.167,21,NO
4,0,137,40,35,168,43.1,2.288,33,YES
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,NO
764,2,122,70,27,0,36.8,0.340,27,NO
765,5,121,72,23,112,26.2,0.245,30,NO
766,1,126,60,0,0,30.1,0.349,47,YES
767,1,93,70,31,0,30.4,0.315,23,NO

In [ ]:
df

### Object Creation using pandas

In [6]:
import pandas as pd
import numpy as np

s = pd.Series([1, 3, 5,np.nan, 6, 8])

s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

#### Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:

In [10]:
#yyyy-mm-dd format
dates = pd.date_range('20220220', periods=6)
dates

DatetimeIndex(['2022-02-20', '2022-02-21', '2022-02-22', '2022-02-23',
               '2022-02-24', '2022-02-25'],
              dtype='datetime64[ns]', freq='D')

In [14]:
#random.randn - randn generates an array of shape,filled with random floats

df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

df

                   A         B         C         D
2022-02-20  1.611840 -0.371961 -1.984483  0.216040
2022-02-21 -0.429335 -0.785766  1.155283 -0.984463
2022-02-22 -1.044172  0.380061 -0.353628  1.129429
2022-02-23  0.851968  0.934742 -0.838783  0.577169
2022-02-24 -0.532900 -1.347217  1.403166  0.578126
2022-02-25  0.870343  0.461512 -1.446261  1.860182

In [13]:
#label
df.loc['2022-02-20']

A    1.041497
B   -1.126299
C   -0.876110
D   -0.485043
Name: 2022-02-20 00:00:00, dtype: float64

In [15]:
#position
df.iloc[0:1]

                  A         B         C        D
2022-02-20  1.61184 -0.371961 -1.984483  0.21604

In [16]:
df.iloc[3:4]

                   A         B         C         D
2022-02-23  0.851968  0.934742 -0.838783  0.577169

In [ ]:
df

#### Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [17]:
df2 = pd.DataFrame({'A': 1.,
   ...:                     'B': pd.Timestamp('20160102'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                     'F': 'foo'})
   ...: 
df2

     A          B    C  D      E    F
0  1.0 2016-01-02  1.0  3   test  foo
1  1.0 2016-01-02  1.0  3  train  foo
2  1.0 2016-01-02  1.0  3   test  foo
3  1.0 2016-01-02  1.0  3  train  foo

In [18]:
dict123 = {'A': 1.,
   ...:                     'B': pd.Timestamp('20160102'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                     'F': 'foo'}

In [19]:
dict123

{'A': 1.0,
 'B': Timestamp('2016-01-02 00:00:00'),
 'C': 0    1.0
 1    1.0
 2    1.0
 3    1.0
 dtype: float32,
 'D': array([3, 3, 3, 3]),
 'E': ['test', 'train', 'test', 'train']
 Categories (2, object): ['test', 'train'],
 'F': 'foo'}

In [ ]:
type(dict123)

In [ ]:
type(df2)

#### The columns of the resulting DataFrame have different dtypes.

In [20]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [21]:
df.shape

(6, 4)

### Viewing data

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.index

In [ ]:
df.columns

In [22]:
#DataFrame.to_numpy() gives a NumPy representation of the underlying data

df.to_numpy()

array([[ 1.61184027, -0.37196059, -1.98448313,  0.21604027],
       [-0.42933493, -0.78576615,  1.15528271, -0.9844626 ],
       [-1.04417158,  0.38006059, -0.3536283 ,  1.12942872],
       [ 0.85196754,  0.93474219, -0.83878268,  0.5771686 ],
       [-0.53289982, -1.34721726,  1.40316647,  0.57812595],
       [ 0.87034315,  0.46151236, -1.4462611 ,  1.86018229]])

In [23]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.221291 -0.121438 -0.344118  0.562747
std    1.034037  0.861798  1.374882  0.950681
min   -1.044172 -1.347217 -1.984483 -0.984463
25%   -0.507009 -0.682315 -1.294391  0.306322
50%    0.211316  0.004050 -0.596205  0.577647
75%    0.865749  0.441149  0.778055  0.991603
max    1.611840  0.934742  1.403166  1.860182

In [24]:
#describe() shows a quick statistic summary of your data:

df.describe().T

   count      mean       std       min       25%       50%       75%       max
A    6.0  0.221291  1.034037 -1.044172 -0.507009  0.211316  0.865749  1.611840
B    6.0 -0.121438  0.861798 -1.347217 -0.682315  0.004050  0.441149  0.934742
C    6.0 -0.344118  1.374882 -1.984483 -1.294391 -0.596205  0.778055  1.403166
D    6.0  0.562747  0.950681 -0.984463  0.306322  0.577647  0.991603  1.860182

In [ ]:
df

In [ ]:
#Transposing your data:

df.transpose()

In [25]:
#Sorting by an axis:

df.sort_index(axis=0, ascending=True)

                   A         B         C         D
2022-02-20  1.611840 -0.371961 -1.984483  0.216040
2022-02-21 -0.429335 -0.785766  1.155283 -0.984463
2022-02-22 -1.044172  0.380061 -0.353628  1.129429
2022-02-23  0.851968  0.934742 -0.838783  0.577169
2022-02-24 -0.532900 -1.347217  1.403166  0.578126
2022-02-25  0.870343  0.461512 -1.446261  1.860182

In [26]:
#Sorting by values:
df.sort_values(by='B')

                   A         B         C         D
2022-02-24 -0.532900 -1.347217  1.403166  0.578126
2022-02-21 -0.429335 -0.785766  1.155283 -0.984463
2022-02-20  1.611840 -0.371961 -1.984483  0.216040
2022-02-22 -1.044172  0.380061 -0.353628  1.129429
2022-02-25  0.870343  0.461512 -1.446261  1.860182
2022-02-23  0.851968  0.934742 -0.838783  0.577169

## Selection

In [ ]:
#Getting
#df['A']

In [27]:
#Selecting via [],
df['C']

2022-02-20   -1.984483
2022-02-21    1.155283
2022-02-22   -0.353628
2022-02-23   -0.838783
2022-02-24    1.403166
2022-02-25   -1.446261
Freq: D, Name: C, dtype: float64

In [ ]:
df

In [ ]:
dates

In [ ]:
df

### Selection by label

In [ ]:
df

In [28]:
df.loc['2020-02-20':'2020-02-22',['A','B','C']]

Empty DataFrame
Columns: [A, B, C]
Index: []

In [29]:
df.iloc[0:]

                   A         B         C         D
2022-02-20  1.611840 -0.371961 -1.984483  0.216040
2022-02-21 -0.429335 -0.785766  1.155283 -0.984463
2022-02-22 -1.044172  0.380061 -0.353628  1.129429
2022-02-23  0.851968  0.934742 -0.838783  0.577169
2022-02-24 -0.532900 -1.347217  1.403166  0.578126
2022-02-25  0.870343  0.461512 -1.446261  1.860182

In [ ]:
selection by label - df.loc

In [ ]:
selection by position - df.iloc

### Selection by position

In [ ]:
df

In [ ]:
df.iloc[0:2,0:3]

In [ ]:
#For slicing rows explicitly:
df.iloc[1:3, :]

In [ ]:
#For slicing columns explicitly:
df.iloc[:, 1:3]

In [ ]:
df

### Setting
Setting a new column automatically aligns the data by the indexes.

In [ ]:
s1 = pd.Series([1, 2, 3, 4], index=pd.date_range('20130102', periods=4))
s1

### Missing data

pandas primarily uses the value np.nan to represent missing data

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [30]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C         D   E
2022-02-20  1.611840 -0.371961 -1.984483  0.216040 NaN
2022-02-21 -0.429335 -0.785766  1.155283 -0.984463 NaN
2022-02-22 -1.044172  0.380061 -0.353628  1.129429 NaN
2022-02-23  0.851968  0.934742 -0.838783  0.577169 NaN

In [31]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C         D    E
2022-02-20  1.611840 -0.371961 -1.984483  0.216040  1.0
2022-02-21 -0.429335 -0.785766  1.155283 -0.984463  1.0
2022-02-22 -1.044172  0.380061 -0.353628  1.129429  NaN
2022-02-23  0.851968  0.934742 -0.838783  0.577169  NaN

In [32]:
df1

                   A         B         C         D    E
2022-02-20  1.611840 -0.371961 -1.984483  0.216040  1.0
2022-02-21 -0.429335 -0.785766  1.155283 -0.984463  1.0
2022-02-22 -1.044172  0.380061 -0.353628  1.129429  NaN
2022-02-23  0.851968  0.934742 -0.838783  0.577169  NaN

In [34]:
df1

                   A         B         C         D    E
2022-02-20  1.611840 -0.371961 -1.984483  0.216040  1.0
2022-02-21 -0.429335 -0.785766  1.155283 -0.984463  1.0
2022-02-22 -1.044172  0.380061 -0.353628  1.129429  NaN
2022-02-23  0.851968  0.934742 -0.838783  0.577169  NaN

#### To drop any rows that have missing data.

In [33]:
df1.dropna(how='any')

                   A         B         C         D    E
2022-02-20  1.611840 -0.371961 -1.984483  0.216040  1.0
2022-02-21 -0.429335 -0.785766  1.155283 -0.984463  1.0

#### Filling missing data.

In [35]:
df1.fillna(value=15)

                   A         B         C         D     E
2022-02-20  1.611840 -0.371961 -1.984483  0.216040   1.0
2022-02-21 -0.429335 -0.785766  1.155283 -0.984463   1.0
2022-02-22 -1.044172  0.380061 -0.353628  1.129429  15.0
2022-02-23  0.851968  0.934742 -0.838783  0.577169  15.0

In [ ]:
df1

In [ ]:
df

In [ ]:
df.describe()

### Operations

#### Stats

In [ ]:
df.max()

In [ ]:
df.describe()

#### Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [ ]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

In [ ]:
df

In [ ]:
s

In [ ]:
df.sub(s, axis='index')

In [ ]:
df

In [ ]:
s

In [ ]:
df

### Apply
Applying functions to the data

In [36]:
#numpy.cumsum() function is used when we want to compute the cumulative sum of array elements over a given axis.
#axis : Axis along which the cumulative sum is computed. The default is to compute the sum of the flattened array.

df.apply(np.cumsum)

                   A         B         C         D
2022-02-20  1.611840 -0.371961 -1.984483  0.216040
2022-02-21  1.182505 -1.157727 -0.829200 -0.768422
2022-02-22  0.138334 -0.777666 -1.182829  0.361006
2022-02-23  0.990301  0.157076 -2.021611  0.938175
2022-02-24  0.457401 -1.190141 -0.618445  1.516301
2022-02-25  1.327745 -0.728629 -2.064706  3.376483

In [ ]:
df

In [37]:
#A lambda function is a small anonymous function
#A lambda function can take any number of arguments, but can only have one expression.

df.apply(lambda x: x.max() - x.min())

A    2.656012
B    2.281959
C    3.387650
D    2.844645
dtype: float64

In [ ]:
0.846579	-1.115364	0.028172	0.014141

### String Methods
Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array

In [38]:
#nan Not a Number

s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [39]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [40]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

### Categoricals

pandas can include categorical data in a DataFrame.

In [42]:
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],
   .....:                    "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})
   .....: 
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [ ]:
df.dtypes

In [43]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

#### Convert the raw grades to a categorical data type.

In [44]:
df["grade"] = df["raw_grade"].astype("category")


df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [ ]:
df.dtypes

In [ ]:
df["raw_grade"].astype("category")

In [ ]:
df

Pandas Contents :

Object creation

Viewing data

Selection

Getting

Selection by label

Selection by position

Boolean indexing

Setting

Missing data

Operations

Stats

Apply

String Methods

Merge

More in Pandas :

Grouping

Reshaping

Stack

Pivot tables

Time series

Categoricals

Plotting

Getting data in/out

CSV

Excel

Gotchas